In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data_set = pd.read_csv(r"D:\data sciense\car_price.csv",encoding="latin1")

In [3]:
data_set.head(2)

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,0,Jeep Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,2017,1956 cc,5 Seats
1,1,Renault Duster RXZ Turbo CVT,12.83 Lakh,"13,248 kms",Petrol,Automatic,1st Owner,2021,1330 cc,5 Seats

In [4]:
data_set.shape

(5512, 10)

In [5]:
data_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5512 entries, 0 to 5511
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           5512 non-null   int64
 1   car_name             5512 non-null   object
 2   car_prices_in_rupee  5512 non-null   object
 3   kms_driven           5512 non-null   object
 4   fuel_type            5512 non-null   object
 5   transmission         5512 non-null   object
 6   ownership            5512 non-null   object
 7   manufacture          5512 non-null   int64
 8   engine               5512 non-null   object
 9   Seats                5512 non-null   object
dtypes: int64(2), object(8)
memory usage: 430.8+ KB

In [6]:
data_set.isnull().sum()

Unnamed: 0             0
car_name               0
car_prices_in_rupee    0
kms_driven             0
fuel_type              0
transmission           0
ownership              0
manufacture            0
engine                 0
Seats                  0
dtype: int64

In [7]:
def company_name(x):
    return x[:x.index(" ")]

In [8]:
data_set["company_name"] = data_set["car_name"].apply(company_name)

In [9]:
def car_name(x):
    return x[x.index(" ")+1:]

In [10]:
data_set["car_name"] = data_set["car_name"].apply(car_name)

In [11]:
data_set.head(2)

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name
0,0,Compass 2.0 Longitude Option BSIV,10.03 Lakh,"86,226 kms",Diesel,Manual,1st Owner,2017,1956 cc,5 Seats,Jeep
1,1,Duster RXZ Turbo CVT,12.83 Lakh,"13,248 kms",Petrol,Automatic,1st Owner,2021,1330 cc,5 Seats,Renault

In [12]:
data_set["car_prices_in_rupee"] = data_set["car_prices_in_rupee"].str.replace(",", " ")

In [13]:
data_set["car_prices_in_rupee"]

0       10.03 Lakh
1       12.83 Lakh
2       16.40 Lakh
3        7.77 Lakh
4        5.15 Lakh
           ...
5507    28.90 Lakh
5508    64.90 Lakh
5509    13.75 Lakh
5510    29.90 Lakh
5511    31.90 Lakh
Name: car_prices_in_rupee, Length: 5512, dtype: object

In [14]:
def rups_change(x):
    p = x.split(" ")
    try:
        if p[1] == "Lakh":
            return str(round(float(p[0])*100000,1))
        elif p[1] == "Crore":
            return str(round(float(p[0])*10000000,1))
    except: return x

In [15]:
data_set["car_prices_in_rupee"] = data_set["car_prices_in_rupee"].apply(rups_change)
data_set["car_prices_in_rupee"] = data_set["car_prices_in_rupee"].astype("float64")

In [16]:
data_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5512 entries, 0 to 5511
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           5512 non-null   int64
 1   car_name             5512 non-null   object
 2   car_prices_in_rupee  5389 non-null   float64
 3   kms_driven           5512 non-null   object
 4   fuel_type            5512 non-null   object
 5   transmission         5512 non-null   object
 6   ownership            5512 non-null   object
 7   manufacture          5512 non-null   int64
 8   engine               5512 non-null   object
 9   Seats                5512 non-null   object
 10  company_name         5512 non-null   object
dtypes: float64(1), int64(2), object(8)
memory usage: 473.8+ KB

In [17]:
data_set["kms_driven"] = data_set["kms_driven"].str.replace(",","")
data_set["kms_driven"] = data_set["kms_driven"].str.replace("kms","")
data_set["kms_driven"] = data_set["kms_driven"].astype("float64")

In [18]:
data_set["kms_driven"]

0       86226.0
1       13248.0
2       60343.0
3       26696.0
4       69414.0
         ...
5507    45000.0
5508    29000.0
5509    90000.0
5510    79000.0
5511    42000.0
Name: kms_driven, Length: 5512, dtype: float64

In [19]:
data_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5512 entries, 0 to 5511
Data columns (total 11 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Unnamed: 0           5512 non-null   int64
 1   car_name             5512 non-null   object
 2   car_prices_in_rupee  5389 non-null   float64
 3   kms_driven           5512 non-null   float64
 4   fuel_type            5512 non-null   object
 5   transmission         5512 non-null   object
 6   ownership            5512 non-null   object
 7   manufacture          5512 non-null   int64
 8   engine               5512 non-null   object
 9   Seats                5512 non-null   object
 10  company_name         5512 non-null   object
dtypes: float64(2), int64(2), object(7)
memory usage: 473.8+ KB

In [20]:
data_set["engine"] = data_set["engine"].str.replace("cc","")
data_set["engine"] = data_set["engine"].astype("float64")

In [21]:
data_set["Seats"] = data_set["Seats"].str.replace("Seats","")
data_set["Seats"] = data_set["Seats"].astype("float64")

In [22]:
data_set.head()

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name
0,0,Compass 2.0 Longitude Option BSIV,1003000.0,86226.0,Diesel,Manual,1st Owner,2017,1956.0,5.0,Jeep
1,1,Duster RXZ Turbo CVT,1283000.0,13248.0,Petrol,Automatic,1st Owner,2021,1330.0,5.0,Renault
2,2,Camry 2.5 G,1640000.0,60343.0,Petrol,Automatic,1st Owner,2016,2494.0,5.0,Toyota
3,3,Jazz VX CVT,777000.0,26696.0,Petrol,Automatic,1st Owner,2018,1199.0,5.0,Honda
4,4,Polo 1.2 MPI Highline,515000.0,69414.0,Petrol,Manual,1st Owner,2016,1199.0,5.0,Volkswagen

In [23]:
data_set["manufacture"] = pd.to_datetime(data_set["manufacture"])

In [24]:
data_set.head()

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats,company_name
0,0,Compass 2.0 Longitude Option BSIV,1003000.0,86226.0,Diesel,Manual,1st Owner,1970-01-01 00:00:00.000002017,1956.0,5.0,Jeep
1,1,Duster RXZ Turbo CVT,1283000.0,13248.0,Petrol,Automatic,1st Owner,1970-01-01 00:00:00.000002021,1330.0,5.0,Renault
2,2,Camry 2.5 G,1640000.0,60343.0,Petrol,Automatic,1st Owner,1970-01-01 00:00:00.000002016,2494.0,5.0,Toyota
3,3,Jazz VX CVT,777000.0,26696.0,Petrol,Automatic,1st Owner,1970-01-01 00:00:00.000002018,1199.0,5.0,Honda
4,4,Polo 1.2 MPI Highline,515000.0,69414.0,Petrol,Manual,1st Owner,1970-01-01 00:00:00.000002016,1199.0,5.0,Volkswagen

This Data ready for The Data Analysis